Revit 2024 API
FabricationPart.VendorCode Property
 The vendor code of the fabrication part.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2017
Syntax
C#
public string VendorCode { get; }
Visual Basic
Public ReadOnly Property VendorCode As String
	Get
Visual C++
public:
property String^ VendorCode {
	String^ get ();
}
See Also
FabricationPart Class
Autodesk.Revit.DB Namespace